cfe llm/Enums/AI_РежимДоступаАгента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>AI_РежимДоступаАгента</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВсемПользователямLLM</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоНазначениям</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отключен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cfe llm/Catalogs/AI_Агенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>AI_Агенты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СистемнаяИнструкция</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Температура</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксТокенов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторДляЛогики</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НуженВебПоиск</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкноКонтекстаВебПоиска</Name>
					<Type>
						<v8:Type>cfg:EnumRef.AI_РазмерКонтекстногоОкнаВебПоиска</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИзвлекатьОтветВСтруктуру</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АгентскийРежим</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрофильДоступаКДанным</Name>
					<Type>
						<v8:Type>d5p1:CatalogRef.AI_ПрофилиДоступаКДанным</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрофильMCP</Name>
					<Type>
						<v8:Type>d5p1:CatalogRef.AI_ПрофилиMCP</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимДоступа</Name>
					<Type>
						<v8:Type>d5p1:EnumRef.AI_РежимДоступаАгента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныйКонтекст</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контекст</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.AI_ДополнительныйКонтекст</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>RAGКоллекции</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Использовать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коллекция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.AI_RAGКоллекции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЛимитФрагментовQdrant</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВесКоллекции</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МинПорогСхожестиВектора</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>RAGРазрешения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Разрешение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.AI_RAGВидыРазрешений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>URLДляПоиска</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>URL</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДоступПользователей</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторПользователя</Name>
							<Type>
								<v8:Type>UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПолноеИмя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПрофильДоступаКДанным</Name>
							<Type>
								<v8:Type>d5p1:CatalogRef.AI_ПрофилиДоступаКДанным</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Активен</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДоступГрупп</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Группа</Name>
							<Type>
								<v8:Type>d5p1:CatalogRef.AI_ГруппыПользователей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПрофильДоступаКДанным</Name>
							<Type>
								<v8:Type>d5p1:CatalogRef.AI_ПрофилиДоступаКДанным</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Приоритет</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Активна</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cfe llm/Catalogs/AI_ГруппыПользователей.xml
<?xml version="1.0" encoding="utf-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>AI_ГруппыПользователей</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Активна</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Участники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторПользователя</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПолноеИмя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cfe llm/CommonModules/AI_ДоступКАгентамСервер/Ext/Module.bsl
Функция ОпределитьДоступТекущегоПользователя(Агент) Экспорт

	Возврат ОпределитьДоступ(
		ПользователиИнформационнойБазы.ТекущийПользователь().УникальныйИдентификатор,
		Агент);

КонецФункции

Функция ОпределитьДоступ(ИдентификаторПользователя, Агент) Экспорт

	ИсходныйПривилегированныйРежим = ПривилегированныйРежим();
	УстановитьПривилегированныйРежим(Истина);
	Попытка
		Результат = ОпределитьДоступВнутренне(ИдентификаторПользователя, Агент);
	Исключение
		УстановитьПривилегированныйРежим(ИсходныйПривилегированныйРежим);
		ВызватьИсключение;
	КонецПопытки;
	УстановитьПривилегированныйРежим(ИсходныйПривилегированныйРежим);
	Возврат Результат;

КонецФункции

Функция ОпределитьДоступВнутренне(ИдентификаторПользователя, Агент)

	Если Не ЗначениеЗаполнено(Агент) Тогда
		Возврат РезультатДоступа(Истина, Справочники.AI_ПрофилиДоступаКДанным.ПустаяСсылка(),
			"Без агента", "");
	КонецЕсли;
	Если ТипЗнч(Агент) <> Тип("СправочникСсылка.AI_Агенты") Тогда
		Возврат РезультатДоступа(Ложь, Справочники.AI_ПрофилиДоступаКДанным.ПустаяСсылка(),
			"", "Передан некорректный агент.");
	КонецЕсли;

	ДанныеАгента = ПолучитьДанныеАгента(Агент);
	Если ДанныеАгента = Неопределено Или ДанныеАгента.ПометкаУдаления Тогда
		Возврат РезультатДоступа(Ложь, Справочники.AI_ПрофилиДоступаКДанным.ПустаяСсылка(),
			"", "Агент не найден или помечен на удаление.");
	КонецЕсли;

	РежимДоступа = ДанныеАгента.РежимДоступа;
	Если РежимДоступа = Перечисления.AI_РежимДоступаАгента.Отключен Тогда
		Возврат РезультатДоступа(Ложь, Справочники.AI_ПрофилиДоступаКДанным.ПустаяСсылка(),
			"", "Доступ к агенту отключен администратором.");
	КонецЕсли;

	Результат = НайтиПерсональноеНазначение(
		Агент,
		ИдентификаторПользователя,
		ДанныеАгента.ПрофильДоступаКДанным);
	Если Результат <> Неопределено Тогда
		Возврат Результат;
	КонецЕсли;

	Результат = НайтиГрупповоеНазначение(
		Агент,
		ИдентификаторПользователя,
		ДанныеАгента.ПрофильДоступаКДанным);
	Если Результат <> Неопределено Тогда
		Возврат Результат;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(РежимДоступа)
		Или РежимДоступа = Перечисления.AI_РежимДоступаАгента.ВсемПользователямLLM Тогда
		Возврат РезультатДоступа(
			Истина,
			ДанныеАгента.ПрофильДоступаКДанным,
			"Режим общего доступа",
			"");
	КонецЕсли;

	Возврат РезультатДоступа(
		Ложь,
		Справочники.AI_ПрофилиДоступаКДанным.ПустаяСсылка(),
		"",
		"Агент не назначен текущему пользователю или его группе.");

КонецФункции

Функция ПроверитьДоступТекущегоПользователя(Агент) Экспорт

	Результат = ОпределитьДоступТекущегоПользователя(Агент);
	Если Не Результат.Разрешен Тогда
		ВызватьИсключение Результат.Причина;
	КонецЕсли;
	Возврат Результат.ПрофильДоступаКДанным;

КонецФункции

Функция ПолучитьДоступныхАгентовТекущегоПользователя() Экспорт

	ИдентификаторПользователя =
		ПользователиИнформационнойБазы.ТекущийПользователь().УникальныйИдентификатор;
	Возврат ПолучитьДоступныхАгентов(ИдентификаторПользователя);

КонецФункции

Функция ПолучитьДоступныхАгентов(ИдентификаторПользователя) Экспорт

	ИсходныйПривилегированныйРежим = ПривилегированныйРежим();
	УстановитьПривилегированныйРежим(Истина);
	Попытка
		Результат = ПолучитьДоступныхАгентовВнутренне(ИдентификаторПользователя);
	Исключение
		УстановитьПривилегированныйРежим(ИсходныйПривилегированныйРежим);
		ВызватьИсключение;
	КонецПопытки;
	УстановитьПривилегированныйРежим(ИсходныйПривилегированныйРежим);
	Возврат Результат;

КонецФункции

Функция ПолучитьДоступныхАгентовВнутренне(ИдентификаторПользователя)

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|  Агенты.Ссылка КАК Агент,
		|  Агенты.Наименование КАК Наименование
		|ИЗ
		|  Справочник.AI_Агенты КАК Агенты
		|ГДЕ
		|  НЕ Агенты.ПометкаУдаления
		|УПОРЯДОЧИТЬ ПО
		|  Наименование";

	Список = Новый СписокЗначений;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат = ОпределитьДоступВнутренне(ИдентификаторПользователя, Выборка.Агент);
		Если Результат.Разрешен Тогда
			Список.Добавить(Выборка.Агент, Выборка.Наименование);
		КонецЕсли;
	КонецЦикла;
	Возврат Список;

КонецФункции

Функция ПолучитьДанныеАгента(Агент)

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|  Агенты.ПометкаУдаления КАК ПометкаУдаления,
		|  Агенты.РежимДоступа КАК РежимДоступа,
		|  Агенты.ПрофильДоступаКДанным КАК ПрофильДоступаКДанным
		|ИЗ
		|  Справочник.AI_Агенты КАК Агенты
		|ГДЕ
		|  Агенты.Ссылка = &Агент";
	Запрос.УстановитьПараметр("Агент", Агент);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Новый Структура(
			"ПометкаУдаления,РежимДоступа,ПрофильДоступаКДанным",
			Выборка.ПометкаУдаления,
			Выборка.РежимДоступа,
			Выборка.ПрофильДоступаКДанным);
	КонецЕсли;
	Возврат Неопределено;

КонецФункции

Функция НайтиПерсональноеНазначение(Агент, ИдентификаторПользователя, ПрофильАгента)

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|  Назначения.ПрофильДоступаКДанным КАК ПрофильДоступаКДанным
		|ИЗ
		|  Справочник.AI_Агенты.ДоступПользователей КАК Назначения
		|ГДЕ
		|  Назначения.Ссылка = &Агент
		|  И Назначения.ИдентификаторПользователя = &ИдентификаторПользователя
		|  И Назначения.Активен";
	Запрос.УстановитьПараметр("Агент", Агент);
	Запрос.УстановитьПараметр("ИдентификаторПользователя", ИдентификаторПользователя);

	Профиль = Неопределено;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ТекущийПрофиль = ЭффективныйПрофиль(Выборка.ПрофильДоступаКДанным, ПрофильАгента);
		Если Профиль = Неопределено Тогда
			Профиль = ТекущийПрофиль;
		ИначеЕсли Профиль <> ТекущийПрофиль Тогда
			Возврат РезультатДоступа(
				Ложь,
				Справочники.AI_ПрофилиДоступаКДанным.ПустаяСсылка(),
				"",
				"Найдены противоречащие персональные назначения агента. Обратитесь к администратору.");
		КонецЕсли;
	КонецЦикла;
	Если Профиль <> Неопределено Тогда
		Возврат РезультатДоступа(Истина, Профиль, "Персональное назначение", "");
	КонецЕсли;
	Возврат Неопределено;

КонецФункции

Функция НайтиГрупповоеНазначение(Агент, ИдентификаторПользователя, ПрофильАгента)

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|  Назначения.Группа КАК Группа,
		|  Назначения.ПрофильДоступаКДанным КАК ПрофильДоступаКДанным,
		|  Назначения.Приоритет КАК Приоритет
		|ИЗ
		|  Справочник.AI_Агенты.ДоступГрупп КАК Назначения
		|    ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.AI_ГруппыПользователей КАК Группы
		|    ПО Назначения.Группа = Группы.Ссылка
		|    ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.AI_ГруппыПользователей.Участники КАК СоставГруппы
		|    ПО Группы.Ссылка = СоставГруппы.Ссылка
		|ГДЕ
		|  Назначения.Ссылка = &Агент
		|  И Назначения.Активна
		|  И Группы.Активна
		|  И СоставГруппы.ИдентификаторПользователя = &ИдентификаторПользователя
		|УПОРЯДОЧИТЬ ПО
		|  Приоритет УБЫВ";
	Запрос.УстановитьПараметр("Агент", Агент);
	Запрос.УстановитьПараметр("ИдентификаторПользователя", ИдентификаторПользователя);

	МаксимальныйПриоритет = Неопределено;
	Профиль = Неопределено;
	Источники = Новый Массив;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если МаксимальныйПриоритет = Неопределено Тогда
			МаксимальныйПриоритет = Выборка.Приоритет;
		ИначеЕсли Выборка.Приоритет < МаксимальныйПриоритет Тогда
			Прервать;
		КонецЕсли;

		ТекущийПрофиль = ЭффективныйПрофиль(Выборка.ПрофильДоступаКДанным, ПрофильАгента);
		Если Профиль = Неопределено Тогда
			Профиль = ТекущийПрофиль;
		ИначеЕсли Профиль <> ТекущийПрофиль Тогда
			Возврат РезультатДоступа(
				Ложь,
				Справочники.AI_ПрофилиДоступаКДанным.ПустаяСсылка(),
				"",
				"Группы с одинаковым приоритетом задают разные профили данных. Обратитесь к администратору.");
		КонецЕсли;
		Источники.Добавить(Строка(Выборка.Группа));
	КонецЦикла;
	Если Профиль <> Неопределено Тогда
		Возврат РезультатДоступа(
			Истина,
			Профиль,
			"Групповое назначение: " + СтрСоединить(Источники, ", "),
			"");
	КонецЕсли;
	Возврат Неопределено;

КонецФункции

Функция ЭффективныйПрофиль(ПрофильНазначения, ПрофильАгента)

	Если ЗначениеЗаполнено(ПрофильНазначения) Тогда
		Возврат ПрофильНазначения;
	КонецЕсли;
	Возврат ПрофильАгента;

КонецФункции

Функция РезультатДоступа(Разрешен, ПрофильДоступаКДанным, Источник, Причина)

	Возврат Новый Структура(
		"Разрешен,ПрофильДоступаКДанным,Источник,Причина",
		Разрешен,
		ПрофильДоступаКДанным,
		Источник,
		Причина);

КонецФункции
